app/controllers/othello/users_controller.rb

    def index
      @users = User.all
---
SELECT "users".* FROM "users" ORDER BY username DESC

    def create
      @user = User.new(user_params)

      if @user.save
---
INSERT INTO "users" ("username", "nickname", "email", "pass") VALUES ($1, $2, $3, $4) RETURNING "username"  [["username", "raquel"], ["nickname", "ryon"], ["email", "sdfd@gkfg.com"], ["pass", "qwer"]]

    def update
      @user = set_user
      if @user.update(update_user_params)
---
UPDATE "users" SET "nickname" = $1 WHERE "users"."username" = $2  [["nickname", "mi_usuario1"], ["username", "Usuario 1"]]